In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('salaries.csv') # creating a dataframe

In [3]:
df

     Name  Salary  Age
0    John   50000   34
1   Sally  120000   45
2  Alyssa   80000   27

In [8]:
df['Name']

0      John
1     Sally
2    Alyssa
Name: Name, dtype: object

In [9]:
df['Age']

0    34
1    45
2    27
Name: Age, dtype: int64

In [10]:
df['Salary']

0     50000
1    120000
2     80000
Name: Salary, dtype: int64

In [11]:
young = df['Age']<30 # Creating a filter for age < 30

In [12]:
young

0    False
1    False
2     True
Name: Age, dtype: bool

In [13]:
df[young] # using the filters

     Name  Salary  Age
2  Alyssa   80000   27